---
kind: type
id: T:Autodesk.Revit.DB.Electrical.PanelScheduleView
source: html/ef4390e8-5a93-fe7f-580b-c8ec297f6b52.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleView

An instance of a panel schedule view.

## Syntax (C#)
```csharp
public class PanelScheduleView : TableView
```